using System.Collections.Generic;

namespace Hastnama.Solico.Application.Shop.Payments.Dto
{
    public class VerifySadadDto
    {
        public string Token { get; set; }

        public string SignData { get; set; }
    }
    
    public static class PortalResponseCode
    {
        public static readonly IDictionary<int, string> Response = new Dictionary<int, string>
        {
            {0, "تراکنش ناموفق بوده است"},
            {3,"پذيرنده کارت فعال نیست لطفا با بخش امور پذيرندگان، تماس حاصل فرمائید"},
            {23,"پذيرنده کارت فعال نیست لطفا با بخش امور پذيرندگان، تماس حاصل فرمائید"},
            {58,"انجام تراکنش مربوطه توسط پايانه ی انجام دهنده مجاز نمی باشد."},
            {61,"مبلغ تراکنش از حد مجاز بالاتر است"},
            {1002,"خطا در سیستم- تراکنش ناموفق"},
            {1003,"IP پذيرنده اشتباه است.لطفا مسئول فنی پذيرنده با بانک تماس حاصل فرمايند"},
            {1004,"لطفا مسئول فنی پذيرنده با بانک تماس حاصل فرمايند،شماره پذيرنده اشتباه است"},
            {1005,"طای دسترسی:لطفا بعدا تلاش فرمايید"},
            {1006,"خطا در سیستم"},
            {1011,"درخواست تکراری- شماره سفارش تکراری می باشد"},
            {1012,"اطلاعات پذيرنده صحیح نیست،يکی از موارد تاريخ،زمان يا کلید تراکنش اشتباه است.لطفا مسئول فنی پذيرنده با بانک تماس حاصل فرمايند"},
            {1015,"پاسخ خطای نامشخص از سمت مرکز"},
            {1017,"مبلغ درخواستی شما جهت پرداخت از حد مجاز تعريف شده برای اينپذيرنده بیشتر است"},
            {1018,"شکال در تاريخ و زمان سیستم. لطفا تاريخ و زمان سرور خود را با بانک هماهنگ نمايید"},
            {1019,"امکان پرداخت از طريق سیستم شتاب برای اين پذيرنده امکان پذير نیست"},
            {1020,"پذيرنده غیرفعال شده است.لطفا جهت فعال سازی با بانک تماس بگیريد"},
            {1023,"آدرس بازگشت پذيرنده نامعتبر است"},
            {1024,"مهر زمانی پذيرنده نامعتبر است"},
            {1025,"امضا تراکنش نامعتبر است"},
            {1026,"شماره سفارش تراکنش نامعتبر است"},
            {1027,"شماره پذيرنده نامعتبر است"},
            {1028,"شماره ترمینال پذيرنده نامعتبر است"},
            {1029,"آدرس IP پرداخت در محدوده آدرس های معتبر اعلام شده توسط پذيرنده نیست .لطفا مسئول فنی پذيرنده با بانک تماس حاصل فرمايند"},
            {1030,"آدرس Domain پرداخت در محدوده آدرس های معتبر اعلام شده توسط پذيرنده نیست .لطفا مسئول فنی پذيرنده با بانک تماس حاصل فرمايند "},
            {1031,"مهلت زمانی شما جهت پرداخت به پايان رسیده است.لطفا مجددا سعی بفرمايید "},
            {1032,"پرداخت با اين کارت , برای پذيرنده مورد نظر شما امکان پذير نیست.لطفا از کارتهای مجاز که توسط پذيرنده معرفی شده است , استفاده نمايید."},
            {1033,"به علت مشکل در سايت پذيرنده, پرداخت برای اين پذيرنده غیرفعال شده است.لطفا مسوول فنی سايت پذيرنده با بانک تماس حاصل فرمايند."},
            {1036,"اطلاعات اضافی ارسال نشده يا دارای اشکال است"},
            {1037,"شماره پذيرنده يا شماره ترمینال پذيرنده صحیح نمیباشد"},
            {1053,"خطا: درخواست معتبر، از سمت پذيرنده صورت نگرفته است لطفا اطلاعات پذيرنده خود را چک کنید"},
            {1055,"مقدار غیرمجاز در ورود اطلاعات"},
            {1056,"سیستم موقتا قطع میباشد.لطفا بعدا تلاش فرمايید."},
            {1058,"سرويس پرداخت اينترنتی خارج از سرويس می باشد.لطفا بعدا سعی بفرمايید."},
            {1061,"لطفا مرورگر خود را بسته و با اجرای مجدد مرورگر￼عملیات پرداخت را انجام دهید"},
            {1064,"لطفا مجددا سعی بفرمايید"},
            {1065,"ارتباط ناموفق .لطفا چند لحظه ديگر مجددا سعی کنید"},
            {1066,"سیستم سرويس دهی پرداخت موقتا غیر فعال شده است"},
            {1068,"با عرض پوزش به علت بروزرسانی , سیستم موقتا قطع میباشد."},
            {1072,"خطا در پردازش پارامترهای اختیاری پذيرنده"},
            {1101,"مبلغ تراکنش نامعتبر است"},
            {1103,"توکن ارسالی نامعتبر است"},
            {1104,"اطلاعات تسهیم صحیح نیست"},
            {1105,"تراکنش بازگشت داده شده است"},
            {1140,"شناسه وارد شده معتبر نمی باشد"},
            {100,"درخواست تکراريست"},
            {101,"مهلت ارسال تراکنش به پايان رسیده است"},
            {-1,"نتیجه تراکنش ناموفق است."},

        };
    }
}